# Sakila Star Schema & ETL

# SETUP Using ipython-sql

- load ipython-sql: `%load_ext sql`

- To execute SQL queries you write one of the following atop of your cell: 
    - `%sql`
        - For a one-liner SQL query
        - You can access a python var using `$`    
    - `%%sql`
        - For a multi-line SQL query
        - You can **NOT** access a python var using `$`

- Adding `"!"` at the beginning of a jupyter cell runs a command in a shell, i.e. we are not running python code but we are running the commmand-line utilities

In [86]:
#unhash if not installed program before
%pip install ipython-sql--trusted-host pypi.org --trusted-host files.pythonhosted.org
GIT_SSL_NO_VERIFY=true
%pip install PyMySQL --trusted-host pypi.org --trusted-host files.pythonhosted.org
GIT_SSL_NO_VERIFY=true

Note: you may need to restart the kernel to use updated packages.Could not fetch URL https://pypi.org/simple/ipython-sql-trusted-host/: There was a problem confirming the ssl certificate: HTTPSConnectionPool(host='pypi.org', port=443): Max retries exceeded with url: /simple/ipython-sql-trusted-host/ (Caused by SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))) - skipping

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))': /simple/ipython-sql-trusted-host/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))': /simple/ipython-sql-trusted-host/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))': /simple/ipython-sql-trusted-host/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))': /simple/ipython-sql-trusted-host/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'SSLError(SSLCertVerificationError(1, '[SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed: unable to get local issuer certificate (_ssl.c:1129)'))': /simple/ipython-sql-trusted-host/
ERROR: Could not find a version that satisfies the requirement ipython-sql--trusted-host (from versions: none)
ERROR: No matching distribution found for ipython-sql--trusted-host
WARNING: There was an error checking the latest version of pip.

NameError: name 'true' is not defined

# STEP1 : Connect to the local database where Sakila is loaded (MySQL)

In [87]:
import pymysql
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [88]:
DB_ENDPOINT= 'localhost'
DB = 'sakila'
DB_USER= 'root'
DB_PASSWORD = '12qwaszx' #TO BE REPLACED WITH PERSONAL PASSWORD
DB_PORT = '3306'

# mysql+pymysql://username:password@host:port/database
conn_string="mysql+pymysql://{}:{}@{}/{}" \
                    .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB)
# print(conn_string)

In [89]:
%sql $conn_string

# STEP2 : Explore the  3NF Schema

## 2.1 How much? What data sizes are we looking at?

In [90]:
%sql select COUNT(*) FROM sakila.rental;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(16044,)]

## 2.2 When? What time period are we talking about?

In [ ]:
%sql select MIN(rental_date), MAX(rental_date) FROM sakila.rental;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(datetime.datetime(2005, 5, 24, 22, 53, 30), datetime.datetime(2006, 2, 14, 15, 16, 3))]

## 2.3 Where? Where do events in this database occur? Are they proportional? (10 rows)

In [ ]:
%sql SELECT DISTINCT(co.country) country, count(ci.city) city FROM sakila.country co JOIN sakila.city ci ON co.country_id = ci.country_id GROUP By co.country LIMIT 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('Afghanistan', 1),
 ('Algeria', 3),
 ('American Samoa', 1),
 ('Angola', 2),
 ('Anguilla', 1),
 ('Argentina', 13),
 ('Armenia', 1),
 ('Australia', 1),
 ('Austria', 3),
 ('Azerbaijan', 2)]

# STEP3: Perform some simple data analysis

## 3.1 Insight 1:   Top Grossing Movies 
- Payments amounts are in table `payment`
- Movies are in table `film`
- They are not directly linked, `payment` refers to a `rental`, `rental` refers to an `inventory` item and `inventory` item refers to a `film`
- `payment` &rarr; `rental` &rarr; `inventory` &rarr; `film`

### 3.1.1 Films

In [ ]:
##COMPLETE CODE to sample film table (5 rows)
%sql SELECT* FROM sakila.film LIMIT 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 1, None, 7, Decimal('2.99'), 50, Decimal('18.99'), 'NC-17', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 1, None, 5, Decimal('2.99'), 117, Decimal('26.99'), 'G', 'Commentaries,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 1, None, 6, Decimal('2.99'), 130, Decimal('22.99'), 'G', 'Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

### 3.1.2 Payments

In [ ]:
##COMPLETE CODE to sample payment table (5 rows)
%sql SELECT* FROM sakila.payment LIMIT 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, 1, 76, Decimal('2.99'), datetime.datetime(2005, 5, 25, 11, 30, 37), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (2, 1, 1, 573, Decimal('0.99'), datetime.datetime(2005, 5, 28, 10, 35, 23), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (3, 1, 1, 1185, Decimal('5.99'), datetime.datetime(2005, 6, 15, 0, 54, 12), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (4, 1, 2, 1422, Decimal('0.99'), datetime.datetime(2005, 6, 15, 18, 2, 53), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (5, 1, 2, 1476, Decimal('9.99'), datetime.datetime(2005, 6, 15, 21, 8, 46), datetime.datetime(2006, 2, 15, 22, 12, 30))]

### 3.1.3 Inventory

In [ ]:
##COMPLETE CODE to sample inventory table (5 rows)
%sql SELECT* FROM sakila.inventory LIMIT 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (2, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (3, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (4, 1, 1, datetime.datetime(2006, 2, 15, 5, 9, 17)),
 (5, 1, 2, datetime.datetime(2006, 2, 15, 5, 9, 17))]

### 3.1.4 Get the movie of every payment with payment date and the customer reference (5 rows)

In [ ]:
##COMPLETE CODE
%sql SELECT p.amount, p.payment_date, p.customer_id, f.title FROM sakila.payment p JOIN sakila.rental r ON p.customer_id = r.customer_id JOIN sakila.inventory i ON r.inventory_id = i.inventory_id JOIN sakila.film f ON f.film_id = i.film_id limit 5

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(Decimal('2.99'), datetime.datetime(2005, 5, 31, 17, 27, 45), 431, 'ACADEMY DINOSAUR'),
 (Decimal('2.99'), datetime.datetime(2005, 6, 16, 2, 41, 30), 431, 'ACADEMY DINOSAUR'),
 (Decimal('4.99'), datetime.datetime(2005, 6, 17, 18, 33, 4), 431, 'ACADEMY DINOSAUR'),
 (Decimal('3.99'), datetime.datetime(2005, 6, 18, 6, 20, 54), 431, 'ACADEMY DINOSAUR'),
 (Decimal('4.99'), datetime.datetime(2005, 6, 18, 6, 47, 29), 431, 'ACADEMY DINOSAUR')]

### 3.1.5 sum movie rental revenue (top 10)

In [ ]:
##COMPLETE CODE
%sql SELECT sum(p.amount) revenue, f.title title FROM sakila.payment p JOIN sakila.rental r ON p.customer_id = r.customer_id JOIN sakila.inventory i ON r.inventory_id = i.inventory_id JOIN sakila.film f ON f.film_id = i.film_id group by f.title order by revenue desc limit 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(Decimal('3837.78'), 'RIDGEMONT SUBMARINE'),
 (Decimal('3806.09'), 'BUCKET BROTHERHOOD'),
 (Decimal('3803.05'), 'ROCKETEER MOTHER'),
 (Decimal('3774.01'), 'FORWARD TEMPLE'),
 (Decimal('3762.11'), 'APACHE DIVINE'),
 (Decimal('3725.41'), 'RUGRATS SHAKESPEARE'),
 (Decimal('3706.12'), 'GRIT CLOCKWORK'),
 (Decimal('3700.22'), 'ZORRO ARK'),
 (Decimal('3698.29'), 'NETWORK PEAK'),
 (Decimal('3695.33'), 'WIFE TURN')]

## 3.2 Insight 2:   Top grossing cities 
- Payments amounts are in table `payment`
- Cities are in table `cities`
- `payment` &rarr; `customer` &rarr; `address` &rarr; `city`

### 3.2.1 Get the city of each payment with customer & rental references (10 rows)

In [ ]:
##COMPLETE CODE city, address, customer, rental, payment
%sql SELECT sakila.city.city, sakila.payment.amount, sakila.payment.payment_date, sakila.customer.customer_id, sakila.rental.rental_id FROM sakila.city JOIN address ON city.city_id=address.city_id JOIN customer ON address.address_id = customer.address_id JOIN rental ON customer.customer_id=rental.customer_id JOIN payment ON rental.rental_id=payment.rental_id LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('A Coruña (La Coruña)', Decimal('0.99'), datetime.datetime(2005, 5, 30, 5, 36, 21), 52, 874),
 ('A Coruña (La Coruña)', Decimal('4.99'), datetime.datetime(2005, 6, 15, 1, 38, 31), 52, 1196),
 ('A Coruña (La Coruña)', Decimal('0.99'), datetime.datetime(2005, 6, 18, 3, 54, 31), 52, 2232),
 ('A Coruña (La Coruña)', Decimal('2.99'), datetime.datetime(2005, 6, 19, 23, 47, 24), 52, 2862),
 ('A Coruña (La Coruña)', Decimal('4.99'), datetime.datetime(2005, 6, 21, 0, 2, 28), 52, 3196),
 ('A Coruña (La Coruña)', Decimal('1.99'), datetime.datetime(2005, 7, 6, 23, 46, 52), 52, 3997),
 ('A Coruña (La Coruña)', Decimal('0.99'), datetime.datetime(2005, 7, 9, 15, 58, 38), 52, 5308),
 ('A Coruña (La Coruña)', Decimal('3.99'), datetime.datetime(2005, 7, 9, 16, 4, 45), 52, 5313),
 ('A Coruña (La Coruña)', Decimal('2.99'), datetime.datetime(2005, 7, 10, 5, 8, 10), 52, 5607),
 ('A Coruña (La Coruña)', Decimal('7.99'), datetime.datetime(2005, 7, 11, 22, 29, 15), 52, 6394)]

### 3.2.2 Top grossing cities (10 rows)

In [ ]:
##COMPLETE CODE
%sql SELECT sakila.city.city, sakila.payment.amount FROM sakila.city JOIN address ON city.city_id=address.city_id JOIN customer ON address.address_id = customer.address_id JOIN rental ON customer.customer_id=rental.customer_id JOIN payment ON rental.rental_id=payment.rental_id ORDER BY payment.amount DESC LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('Naju', Decimal('11.99')),
 ('Osmaniye', Decimal('11.99')),
 ('Belém', Decimal('11.99')),
 ('Mannheim', Decimal('11.99')),
 ('Juiz de Fora', Decimal('11.99')),
 ('Arlington', Decimal('11.99')),
 ('Pemalang', Decimal('11.99')),
 ('Siegen', Decimal('11.99')),
 ('Székesfehérvár', Decimal('11.99')),
 ('Usak', Decimal('11.99'))]

## 3.3 Insight 3 : Revenue of a movie by customer city and by month

### 3.3.1 Total revenue by month (10 rows)
#sql EXTRACT() gets a datepart from date column

In [ ]:
##COMPLETE CODE
%sql select sum(amount) revenue, month(payment_date) month FROM payment GROUP BY month LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(Decimal('4823.44'), 5),
 (Decimal('9629.89'), 6),
 (Decimal('28368.91'), 7),
 (Decimal('24070.14'), 8),
 (Decimal('514.18'), 2)]

### 3.3.2 Each movie and amount, by customer, city and by month (10 rows)

In [ ]:
##COMPLETE CODE for each rental, give amount, city, month, customer
%sql SELECT film.title, payment.amount, customer.first_name, customer.last_name, city.city, month(payment.payment_date) FROM sakila.film JOIN sakila.inventory JOIN sakila.rental JOIN sakila.payment JOIN sakila.customer JOIN sakila.address JOIN sakila.city ON film.film_id=inventory.film_id AND inventory.inventory_id=rental.inventory_id AND rental.rental_id=payment.payment_id AND payment.customer_id=customer.customer_id AND customer.address_id=address.address_id AND address.city_id=city.city_id LIMIT 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('BLANKET BEVERLY', Decimal('2.99'), 'MARY', 'SMITH', 'Sasebo', 5),
 ('FREAKY POCUS', Decimal('0.99'), 'MARY', 'SMITH', 'Sasebo', 5),
 ('GRADUATE LORD', Decimal('5.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('LOVE SUICIDES', Decimal('0.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('IDOLS SNATCHERS', Decimal('9.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('MYSTIC TRUMAN', Decimal('4.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('SWARM GOLD', Decimal('4.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('LAWLESS VISION', Decimal('0.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('MATRIX SNOWMAN', Decimal('3.99'), 'MARY', 'SMITH', 'Sasebo', 6),
 ('HANGING DEEP', Decimal('5.99'), 'MARY', 'SMITH', 'Sasebo', 7)]

### 3.3.3 FINAL ANALYSIS: Sum of revenue of each movie by city and by month (10 rows)

In [ ]:
##COMPLETE CODE
%sql SELECT film.title film, SUM(payment.amount) amount, city.city, EXTRACT(month FROM payment.payment_date) month FROM sakila.film JOIN sakila.inventory JOIN sakila.rental JOIN sakila.payment JOIN sakila.customer JOIN sakila.address JOIN sakila.city ON film.film_id= inventory.film_id AND inventory.inventory_id= rental.inventory_id AND rental.rental_id= payment.payment_id AND payment.customer_id= customer.customer_id AND customer.address_id= address.address_id AND address.city_id= city.city_id GROUP BY  film, month, city LIMIT 10

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('ESCAPE METROPOLIS', Decimal('0.99'), 'A Coruña (La Coruña)', 5),
 ('WATERFRONT DELIVERANCE', Decimal('4.99'), 'A Coruña (La Coruña)', 6),
 ('ADAPTATION HOLES', Decimal('0.99'), 'A Coruña (La Coruña)', 6),
 ('SLEUTH ORIENT', Decimal('2.99'), 'A Coruña (La Coruña)', 6),
 ('TOMORROW HUSTLER', Decimal('4.99'), 'A Coruña (La Coruña)', 6),
 ('RUGRATS SHAKESPEARE', Decimal('1.99'), 'A Coruña (La Coruña)', 7),
 ('PULP BEVERLY', Decimal('0.99'), 'A Coruña (La Coruña)', 7),
 ('CAMPUS REMEMBER', Decimal('3.99'), 'A Coruña (La Coruña)', 7),
 ('KNOCK WARLOCK', Decimal('2.99'), 'A Coruña (La Coruña)', 7),
 ('TYCOON GATHERING', Decimal('7.99'), 'A Coruña (La Coruña)', 7)]

# STEP4 : Creating Facts & Dimensions Tables as Star diagram

In [125]:
%%sql
CREATE TABLE if not exists factsales(
    sales_key MEDIUMINT UNSIGNED AUTO_INCREMENT, 
    date_key MEDIUMINT UNSIGNED, 
    customer_key MEDIUMINT UNSIGNED, 
    movie_key MEDIUMINT UNSIGNED, 
    store_key TINYINT UNSIGNED,
    sales_amount TINYINT UNSIGNED, 
    PRIMARY KEY(sales_key)
)

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [126]:
%%sql
ALTER TABLE factsales
    ADD CONSTRAINT fk_sales_date FOREIGN KEY(date_key) REFERENCES dimdate(date_key),
    ADD CONSTRAINT fk_sales_customer FOREIGN KEY(customer_key) REFERENCES dimcustomer(customer_key),
    ADD CONSTRAINT fk_sales_movie FOREIGN KEY(movie_key) REFERENCES dimmovie(movie_key),
    ADD CONSTRAINT fk_sales_store FOREIGN KEY(store_key) REFERENCES dimstore(store_key)

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [93]:
%%sql
CREATE TABLE IF NOT EXISTS dimdate(
    date_key MEDIUMINT UNSIGNED AUTO_INCREMENT,
    date DATETIME,
    year INT UNSIGNED,
    quarter TINYINT UNSIGNED,
    month TINYINT UNSIGNED,
    day TINYINT UNSIGNED,
    week TINYINT UNSIGNED,
    is_weekend ENUM('0','1'),
    PRIMARY KEY(date_key))

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [94]:
%%sql
CREATE TABLE if not exists dimmovie(
movie_key MEDIUMINT UNSIGNED AUTO_INCREMENT,
film_id MEDIUMINT UNSIGNED,
title VARCHAR(75),
description VARCHAR(250),
release_year INT UNSIGNED,
language VARCHAR(25),
original_language VARCHAR(25),
rental_duration INT UNSIGNED,
length INT UNSIGNED,
rating enum('G','PG','PG-13','R','NC-17'),
special_features set('Trailers','Commentaries','Deleted Scenes','Behind the Scenes'),
PRIMARY KEY(movie_key))

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [96]:
%%sql
CREATE TABLE if not exists dimcustomer(
customer_key MEDIUMINT UNSIGNED AUTO_INCREMENT,
customer_id MEDIUMINT UNSIGNED,
first_name VARCHAR(50),
last_name VARCHAR(50),
email VARCHAR(50),
address VARCHAR(50),
address2 VARCHAR(50),
district VARCHAR(50),
city VARCHAR(50),
country VARCHAR(50),
postal_code VARCHAR(20),
phone VARCHAR(20),
active TINYINT,
create_date DATETIME,
start_date DATETIME,
end_date DATETIME,
PRIMARY KEY(customer_key)
)

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [124]:
%%sql
CREATE TABLE IF NOT EXISTS dimstore(
store_key TINYINT UNSIGNED,
store_id TINYINT UNSIGNED,
address VARCHAR(50),
address2 VARCHAR(50),
district VARCHAR(50),
city VARCHAR(50),
country VARCHAR(50),
postal_code VARCHAR(20),
manager_first_name VARCHAR(50),
manager_last_name VARCHAR(50),
start_date DATETIME,
end_date DATETIME,
PRIMARY KEY(store_key)
)

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

# STEP 5: Pipe the data from 3NF tables to Facts & Dimension Tables

In [ ]:
%%sql
insert into dimmovie (film_id, title, description, release_year, language, original_language ,rental_duration, length, rating, special_features)
SELECT  f.film_id , f.title, f.description, f.release_year, l.name as language, l1.name as original_language, f.rental_duration, f.length, f.rating, f.special_features
FROM film as f
left join language as l on f.language_id = l.language_id
left join film as f1 on f.film_id = f1.film_id
left join language as l1 on f1.original_language_id = l1.language_id

 * mysql+pymysql://root:***@localhost/sakila
1000 rows affected.

[]

In [109]:
%%sql
insert into dimcustomer (customer_id, first_name, last_name, email, address, address2, district, city, country, postal_code, phone, active, create_date, start_date, end_date)
SELECT  c.customer_id, c.first_name, c.last_name, c.email, a.address, a.address2, a.district, ci.city, co.country, a.postal_code, a.phone, c.active, c.create_date, c.create_date as start_date, c.last_update as end_date
FROM customer as c
left join address as a on c.address_id=a.address_id
left join city as ci on a.city_id=ci.city_id
left join country as co on ci.country_id=co.country_id

 * mysql+pymysql://root:***@localhost/sakila
0 rows affected.

[]

In [135]:
%%sql 
INSERT INTO dimdate
(date, year, quarter, month, day, week, is_weekend)
SELECT rental_date as date, YEAR(rental_date) year, QUARTER(rental_date) quarter,
MONTH(rental_date) month, DAY(rental_date) day, WEEK(rental_date) week,
CASE WHEN WEEKDAY(rental_date) IN (7,1) THEN 1 ELSE 0 END as is_weekend
FROM rental

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.DataError) (1265, "Data truncated for column 'is_weekend' at row 9")
[SQL: INSERT INTO dimdate
(date, year, quarter, month, day, week, is_weekend)
SELECT rental_date as date, YEAR(rental_date) year, QUARTER(rental_date) quarter,
MONTH(rental_date) month, DAY(rental_date) day, WEEK(rental_date) week,
CASE WHEN WEEKDAY(rental_date) IN (7,1) THEN 1 ELSE 0 END as is_weekend
FROM rental]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [127]:
%%sql
insert into dimstore (store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id, a.address, a.address2, a.district, ci.city, co.country, a.postal_code, staff.first_name as manager_first_name, staff.last_name as manager_last_name , MIN(r.rental_date) as start_date, MAX(r.rental_date) as end_date
FROM staff
left join store as s on staff.store_id=s.store_id
left join address as a on s.address_id=a.address_id
left join city as ci on a.city_id=ci.city_id
left join country as co on ci.country_id=co.country_id
right join rental as r on staff.staff_id=r.staff_id
GROUP BY s.store_id

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.OperationalError) (1055, "Expression #8 of SELECT list is not in GROUP BY clause and contains nonaggregated column 'sakila.staff.first_name' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by")
[SQL: insert into dimstore (store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id, a.address, a.address2, a.district, ci.city, co.country, a.postal_code, staff.first_name as manager_first_name, staff.last_name as manager_last_name , MIN(r.rental_date) as start_date, MAX(r.rental_date) as end_date
FROM staff
left join store as s on staff.store_id=s.store_id
left join address as a on s.address_id=a.address_id
left join city as ci on a.city_id=ci.city_id
left join country as co on ci.country_id=co.country_id
right join rental as r on staff.staff_id=r.staff_id
GROUP BY s.store_id]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql
INSERT into factsales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT .date_key, .customer_key, .movie_key, .store_key, .sales amount
FROM 
JOIN

# STEP 6: Repeat the final computation (Each movie and sum of amount, by customer, city and by month) from the facts & dimension table

## 6.1 Facts Table has all the needed dimensions, no need for deep joins
Sample of facts table (5 rows)

In [ ]:
%%time
##COMPLETE CODE check out facts table, that it's what we expected

## 6.2 Join fact table with dimensions tables to replace 'keys' with necessary attributes
Code for timing given - to time sample process!

In [ ]:
%%time
##COMPLETE CODE make random query that pulls one fact from each of 5 tables

## 6.3 With fact & dimensions tables compute the final analysis (Sum of revenue of each movie by city and by month)
Code for timing given - to time full process!

In [ ]:
%%time
##COMPLETE CODE

## 6.4 With Original database designed tables compute the final analysis (Sum of revenue of each movie by city and by month)
Code for timing given - to time full process!
Use code in above cell without the limitation on output rows

In [ ]:
%%time
##COMPLETE CODE

# Conclusion

Write 2 lines of your findings